Revit 2024 API
Transform1D Methods
The Transform1D type exposes the following members.
Methods
Name | Description
AlmostEqual
 Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Assign
 Assigns values from the input transformation to this transformation.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetInverse
 Gets the inverse transformation of this transformation.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Multiply
 Multiplies this transformation by the specified transformation and returns the result.
OfPoint
 Applies the transformation to the 1-dimensional point and returns the result.
OfVector
 Applies the transformation to the 1-dimensional vector (a "tangent vector" on the real line) and returns the result.
SetToIdentity
 Set this TrfUV to the identity transform
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
TransformParameterDomain
 Performs a transform of the parameter range defined by domain, and ensures that the domain is ordered correctly.
See Also
Transform1D Class
Autodesk.Revit.DB Namespace